[
    {
        "model": "records.record",
        "pk": 1,
        "fields": {
            "name": "Bayesian Statistics",
            "type_of_document": "Certificate",
            "institution": "Duke University",
            "specialization": "No",
            "date": "2018-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Gained skils in Bayesian Statistics, Bayesian Linear Regression, Bayesian Inference and R-Programming.",
            "image_id": "IMG0001.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 2,
        "fields": {
            "name": "Bayesian Statistics: From Concept to Data Analysis",
            "type_of_document": "Certificate",
            "institution": "UC Santa Cruz",
            "specialization": "No",
            "date": "2024-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Describe and apply the Bayesian approach to statistics. Explain the key differences between Bayesian and Frequentist approaches. Master the basics of the R computing environment.",
            "image_id": "IMG0002.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 3,
        "fields": {
            "name": "Bayesian Statistics: Techniques and Models",
            "type_of_document": "Certificate",
            "institution": "UC Santa Cruz",
            "specialization": "No",
            "date": "2018-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Efficiently and effectively communicate the results of data analysis.Use statistical modeling results to draw scientific conclusions. Extend basic statistical models to account for correlated observations using hierarchical models.",
            "image_id": "IMG0003.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 4,
        "fields": {
            "name": "The UNIX Workbench",
            "type_of_document": "Certificate",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": " Most of the technologies discussed are accessed via a command line interface. Command line interfaces can seem alien at first, a parallel is drawn between using the command line and actions that you would normally take while using the mouse and keyboard. How to write little pieces of software in Bash, which allows you to connect together the tools discussed.",
            "image_id": "IMG0004.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 5,
        "fields": {
            "name": "Supervised Machine Learning: Regression and Classification",
            "type_of_document": "Certificate",
            "institution": "Stanford University",
            "specialization": "No",
            "date": "2022-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": " Build machine learning models in Python using popular machine learning libraries NumPy & scikit-learn. Build and train supervised machine learning models for prediction & binary classification tasks, including linear regression & logistic regression.",
            "image_id": "IMG0005.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 6,
        "fields": {
            "name": "Advanced Learning Algorithms",
            "type_of_document": "Certificate",
            "institution": "Stanford University",
            "specialization": "No",
            "date": "2022-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": " Build and train a neural network with TensorFlow to perform multi-class classification. Apply best practices for machine learning development so that your models generalize to data and tasks in the real world. Build and use decision trees and tree ensemble methods, including random forests and boosted trees.",
            "image_id": "IMG0006.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 7,
        "fields": {
            "name": "Unsupervised Learning, Recommenders, Reinforcement Learning",
            "type_of_document": "Certificate",
            "institution": "Stanford University",
            "specialization": "No",
            "date": "2022-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": " Use unsupervised learning techniques for unsupervised learning: including clustering and anomaly detection. Build  recommender systems with a collaborative filtering approach and a content-based deep learning method. Build a deep reinforcement learning model.",
            "image_id": "IMG0007.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 8,
        "fields": {
            "name": "Machine Learning",
            "type_of_document": "Specialization",
            "institution": "Stanford University",
            "specialization": "Yes",
            "date": "2022-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": " Use unsupervised learning techniques for unsupervised learning: including clustering and anomaly detection. Build recommender systems with a collaborative filtering approach and a content-based deep learning method. Build a deep reinforcement learning model.",
            "image_id": "IMG0008.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 9,
        "fields": {
            "name": "Introduction to Generative AI for Software Development",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2025-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Gained skils in prompting best practices for software development, assigning an LLM role or persona, designing data structures for real world deployment at scale, analyzing code with an LLM and pair-coding with an LLM.",
            "image_id": "IMG0009.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 10,
        "fields": {
            "name": "Data Engineering",
            "type_of_document": "Specialization",
            "institution": "DeepLearning.AI / AWS",
            "specialization": "Yes",
            "date": "2025-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Develop a mental model for the field of data engineering as a whole, including the data engineering lifecycle and its undercurrents. Build your skill in the five stages of the data engineering lifecycle; including generating, ingesting, storing, transforming, and serving data. Learn a framework for approaching any data engineering project you work on so you can effectively create business value with data. Learn the principles of good data architecture and apply them to build data systems on the AWS cloud.",
            "image_id": "IMG0010.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 11,
        "fields": {
            "name": "Introduction to Data Engineering",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI / AWS",
            "specialization": "No",
            "date": "2024-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Gain a high-level overview of the data engineering lifecycle and key undercurrents to understand how data engineers add business value to organizations. Start developing a mental framework for thinking like a data engineer, starting with gathering stakeholder needs and translating them into system. requirements. Learn the basics of working on the cloud from an AWS expert.",
            "image_id": "IMG0011.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 12,
        "fields": {
            "name": "Source Systems, Data Ingestion, and Pipelines",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI / AWS",
            "specialization": "No",
            "date": "2024-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "various types of source systems, learn how they generate and update data, and troubleshoot common issues you might encounter when trying to connect to these systems in the real world. Dive into the details of common ingestion patterns and implement batch and streaming pipelines. Automate and orchestrate your data pipelines using infrastructure as code and pipelines as code tools. Explore AWS and open source tools for monitoring your data systems and data quality.",
            "image_id": "IMG0012.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 13,
        "fields": {
            "name": "Data Storage and Queries",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI / AWS",
            "specialization": "No",
            "date": "2024-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "the raw ingredients and processes that are used to physically store data on disk and in memory. Explore different storage systems, including object, block, and file storage, as well as databases, that are built on top of these raw ingredients. Use the Cypher language to query a Neo4j graph database, and perform vector similarity search, a key feature behind generative AI and large language models. You will explore the evolution of data storage abstractions, from data warehouses, to data lakes, and data lakehouses, while comparing the advantages and drawbacks of each architectural paradigm. Design a simple data lake using Amazon Glue, and build a data lakehouse using AWS LakeFormation and Apache Iceberg. How queries work behind the scenes, practice writing advanced SQL queries, compare the query performance in row vs column-oriented storage, and perform streaming queries using Apache Flink.",
            "image_id": "IMG0013.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 14,
        "fields": {
            "name": "Data Modeling, Transformation, and Serving",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI / AWS",
            "specialization": "No",
            "date": "2025-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Model, transform, and serve data for both analytics and machine learning use cases. Explore various data modeling techniques for batch analytics, including normalization, star schema, data vault, and one big table, and use dbt to transform a dataset based on a star schema and one big table. Compare the Inmon vs Kimball data modeling approaches for data warehouses. Model and transform a tabular dataset for machine learning purposes. Model and transform unstructured image and textual data. Explore distributed processing frameworks such as Hadoop MapReduce and Spark, and perform stream processing. Identify different ways of serving data for analytics and machine learning, including using views and materialized views, describe how a semantic layer built on top of a data model can support the business. Complete a capstone project where an end-to-end data pipeline that encompasses all of the stages of the data engineering lifecycle is built to serve data that provides business value.",
            "image_id": "IMG0014.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 15,
        "fields": {
            "name": "Neural Networks and Deep Learning",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2018-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "The foundational concept of neural networks and deep learning. The significant technological trends driving the rise of deep learning; build, train, and apply fully connected deep neural networks; implement efficient (vectorized) neural networks; identify key parameters in a neural network architecture; and apply deep learning to your own applications.",
            "image_id": "IMG0015.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 16,
        "fields": {
            "name": "Improving Deep Neural Networks: Hyperparameter Tuning, Regularization and Optimization",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2018-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Open the deep learning black box to understand the processes that drive performance and generate good results systematically. Best practices to train and develop test sets and analyze bias/variance for building deep learning applications; be able to use standard neural network techniques such as initialization, L2 and dropout regularization, hyperparameter tuning, batch normalization, and gradient checking; implement and apply a variety of optimization algorithms, such as mini-batch gradient descent, Momentum, RMSprop and Adam, and check for their convergence; and implement a neural network in TensorFlow.",
            "image_id": "IMG0016.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 17,
        "fields": {
            "name": "Structuring Machine Learning Projects",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2018-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "How to build a successful machine learning project and get to practice decision-making as a machine learning project leader. Diagnose errors in a machine learning system; prioritize strategies for reducing errors; understand complex ML settings, such as mismatched training/test sets, and comparing to and/or surpassing human-level performance; and apply end-to-end learning, transfer learning, and multi-task learning.",
            "image_id": "IMG0017.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 18,
        "fields": {
            "name": "Convolutional Neural Networks",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2018-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Understand how computer vision has evolved and become familiar with its exciting applications such as autonomous driving, face recognition, reading radiology images, and more. Build a convolutional neural network, including recent variations such as residual networks; apply convolutional networks to visual detection and recognition tasks; and use neural style transfer to generate art and apply these algorithms to a variety of image, video, and other 2D or 3D data. ",
            "image_id": "IMG0018.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 19,
        "fields": {
            "name": "Sequence Models",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2018-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Sequence models and their exciting applications such as speech recognition, music synthesis, chatbots, machine translation, natural language processing (NLP), and more. Build and train Recurrent Neural Networks (RNNs) and commonly-used variants such as GRUs and LSTMs; apply RNNs to Character-level Language Modeling; gain experience with natural language processing and Word Embeddings; and use HuggingFace tokenizers and transformer models to solve different NLP tasks such as NER and Question Answering.",
            "image_id": "IMG0019.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 20,
        "fields": {
            "name": "Deep Learning",
            "type_of_document": "Specialization",
            "institution": "DeepLearning.AI",
            "specialization": "Yes",
            "date": "2018-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Build and train deep neural networks, identify key architecture parameters, implement vectorized neural networks and deep learning to applications. Train test sets, analyze variance for DL applications, use standard techniques and optimization algorithms, and build neural networks in TensorFlow. Build a CNN and apply it to detection and recognition tasks, use neural style transfer to generate art, and apply algorithms to image and video data. Build and train RNNs, work with NLP and Word Embeddings, and use HuggingFace tokenizers and transformer models to perform NER and Question Answering.",
            "image_id": "IMG0020.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 21,
        "fields": {
            "name": "Natural Language Processing with Classification and Vector Spaces",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2020-04-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use logistic regression, naïve Bayes, and word vectors to implement sentiment analysis, complete analogies & translate words.",
            "image_id": "IMG0021.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 22,
        "fields": {
            "name": "Natural Language Processing with Classification with probabislic models",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2020-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use dynamic programming, hidden Markov models, and word embeddings to implement autocorrect, autocomplete & identify part-of-speech tags for words.",
            "image_id": "IMG0022.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 23,
        "fields": {
            "name": "Natural Language Processing with Sequence Models",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2020-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use recurrent neural networks, LSTMs, GRUs & Siamese networks in TensorFlow for sentiment analysis, text generation & named entity recognition.",
            "image_id": "IMG0023.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 24,
        "fields": {
            "name": "Natural Language Processing with Attention Models",
            "type_of_document": "Certificate",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2020-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use encoder-decoder, causal, & self-attention to machine translate complete sentences, summarize text, and answer questions.",
            "image_id": "IMG0024.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 25,
        "fields": {
            "name": "Natural Language Processing",
            "type_of_document": "Specialization",
            "institution": "DeepLearning.AI",
            "specialization": "Yes",
            "date": "2020-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use logistic regression, naïve Bayes, and word vectors to implement sentiment analysis, complete analogies & translate words. Use dynamic programming, hidden Markov models, and word embeddings to implement autocorrect, autocomplete & identify part-of-speech tags for words. Use recurrent neural networks, LSTMs, GRUs & Siamese networks for sentiment analysis, text generation & named entity recognition.Use encoder-decoder, causal, & self-attention to machine translate complete sentences, summarize text, and answer questions.",
            "image_id": "IMG0025.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 26,
        "fields": {
            "name": "Single Page Web Applications with AngularJS",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2020-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learning just how easy it is to validate forms with Angular. Delve into unit testing AngularJS code. How to set up tests for every type of major Angular artifact: controller, service, directive, and component, as well as how to test services that access the network through the HTTP service. Setting up authentication, editing, and uploading pictures and so on.",
            "image_id": "IMG0026.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 27,
        "fields": {
            "name": "HTML, CSS, and Javascript for Web Developers",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2020-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "The basic tools that every web page coder needs to know. Learning how to implement modern web pages with HTML and CSS, how to code pages such that its components rearrange and resize themselves automatically based on the size of the user screen. Code up a web page that will be just as useful on a mobile phone as on a desktop computer. No “pinch and zoom” required! Last but certainly not least, we will get a thorough introduction to the most ubiquitous, popular, and incredibly powerful language of the web: Javascript. Using Javascript, you will be able to build a fully functional web application that utilizes Ajax to expose server-side functionality and data to the end user.",
            "image_id": "IMG0027.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 28,
        "fields": {
            "name": "Algorithmic Toolbox",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "No",
            "date": "2022-11-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Basic algorithmic techniques and ideas for computational problems arising frequently in practical applications: sorting and searching, divide and conquer, greedy algorithms, dynamic programming. How to sort data and how it helps for searching; how to break a large problem into pieces and solve them recursively; when it makes sense to proceed greedily; how dynamic programming is used in genomic studies. Practice solving computational problems, designing new algorithms, and implementing solutions efficiently (so that they run in less than a second).",
            "image_id": "IMG0028.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 29,
        "fields": {
            "name": "Data Structures",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "No",
            "date": "2023-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "A good algorithm usually comes together with a set of good data structures that allow the algorithm to manipulate the data efficiently. The common data structures that are used in various computational problems are considered . Learned how these data structures are implemented in different programming languages and practiced implementing them in programming assignments. Understandood what is going on inside a particular built-in implementation of a data structure and what to expect from it. Learned typical use cases for these data structures. A few examples of questions covered are the following: 1. What is a good strategy of resizing a dynamic array? 2. How priority queues are implemented in C++, Java, and Python? How to implement a hash table so that the amortized running time of all operations is O(1) on average? What are good strategies to keep a binary tree balanced?",
            "image_id": "IMG0029.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 30,
        "fields": {
            "name": "Algorithms on Graphs",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "No",
            "date": "2024-08-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learned what a graph is and what are some of the most important properties. Learned several ways to traverse graphs and how you can do useful things while traversing the graph in some order. Shortest paths algorithms — from the basic ones to those which open door for 1000000 times faster algorithms used in Google Maps and other navigational services. Minimum spanning trees which are used to plan road, telephone and computer networks and also find applications in clustering and approximate algorithms.",
            "image_id": "IMG0030.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 31,
        "fields": {
            "name": "Fundamentals of Reinforcement Learning",
            "type_of_document": "Certification",
            "institution": "University of Alberta",
            "specialization": "No",
            "date": "2020-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Formalize problems as Markov Decision Processes. Understand basic exploration methods and the exploration / exploitation tradeoff. Understand value functions, as a general-purpose tool for optimal decision-making. Know how to implement dynamic programming as an efficient solution approach to an industrial control problem.",
            "image_id": "IMG0031.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 32,
        "fields": {
            "name": "Sample-based Learning Methods",
            "type_of_document": "Certification",
            "institution": "University of Alberta",
            "specialization": "No",
            "date": "2020-11-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Several algorithms that can learn near optimal policies based on trial and error interaction with the environment---learning from the agent own experience. Learning from actual experience is striking because it requires no prior knowledge of the environment dynamics, yet can still attain optimal behavior. Simple but powerful Monte Carlo methods, and temporal difference learning methods including Q-learning. Investigating how we can get the best of both worlds: algorithms that can combine model-based planning (similar to dynamic programming) and temporal difference updates to radically accelerate learning.",
            "image_id": "IMG0032.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 33,
        "fields": {
            "name": "Prediction and Control with Function Approximation",
            "type_of_document": "Certification",
            "institution": "University of Alberta",
            "specialization": "No",
            "date": "2020-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "How to solve problems with large, high-dimensional, and potentially infinite state spaces. Show that estimating value functions can be cast as a supervised learning problem---function approximation---allowing you to build agents that carefully balance generalization and discrimination in order to maximize reward. Investigating how our policy evaluation or prediction methods like Monte Carlo and TD can be extended to the function approximation setting. Feature construction techniques for RL, and representation learning via neural networks and backprop. We conclude this course with a deep-dive into policy gradient methods; a way to learn policies directly without learning a value function. Solve two continuous-state control tasks and investigate the benefits of policy gradient methods in a continuous-action environment.",
            "image_id": "IMG0033.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 34,
        "fields": {
            "name": "A Complete Reinforcement Learning System (Capstone)",
            "type_of_document": "Certification",
            "institution": "University of Alberta",
            "specialization": "No",
            "date": "2021-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Implement a complete RL solution to a problem. This capstone let you see how each component---problem formulation, algorithm selection, parameter selection and representation design---fits together into a complete solution, and how to make appropriate choices when deploying RL in the real world. The project requires to implement both the environment to stimulate the problem, and a control agent with Neural Network function approximation. In addition, had to conduct a scientific study of the learning system to develop the ability to assess the robustness of RL agents. Appropriately formalize the problem as an MDP, select appropriate algorithms, identify what choices in your implementation will have large impacts on performance and validate the expected behaviour of your algorithms.",
            "image_id": "IMG0034.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 35,
        "fields": {
            "name": "Reinforcement Learning",
            "type_of_document": "Certification",
            "institution": "University of Alberta",
            "specialization": "Yes",
            "date": "2021-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Build a Reinforcement Learning system for sequential decision making. Understand the space of RL algorithms (Temporal- Difference learning, Monte Carlo, Sarsa, Q-learning, Policy Gradients, Dyna, and more). Understand how to formalize your task as a Reinforcement Learning problem, and how to begin implementing a solution. Understand how RL fits under the broader umbrella of machine learning, and how it complements deep learning, supervised and unsupervised learning.",
            "image_id": "IMG0035.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 36,
        "fields": {
            "name": "The Data Scientist Toolbox",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2017-08-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Set up R, R-Studio, Github and other useful tools. Understand the data, problems, and tools that data analysts use. Explain essential study design concepts. Create a Github repository",
            "image_id": "IMG0036.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 37,
        "fields": {
            "name": "R Programming",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2017-09-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Understand critical programming language concepts. Configure statistical programming software. Make use of R loop functions and debugging tools. Collect detailed information using R profiler.",
            "image_id": "IMG0037.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 38,
        "fields": {
            "name": "Getting and Cleaning Data",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2017-10-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Understand common data storage systems. Apply data cleaning basics to make data tidy. Use R for text and date manipulation. Obtain usable data from the web, APIs, and databases.",
            "image_id": "IMG0038.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 39,
        "fields": {
            "name": "Exploratory Data Analysis",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-01-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Understand analytic graphics and the base plotting system in R. Use advanced graphing systems such as the Lattice system. Make graphical displays of very high dimensional data. Apply cluster analysis techniques to locate patterns in data.",
            "image_id": "IMG0039.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 40,
        "fields": {
            "name": "Reproducible Research",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-01-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Organize data analysis to help make it more reproducible. Write up a reproducible data analysis using knitr. Determine the reproducibility of analysis project. Publish reproducible web documents using Markdown.",
            "image_id": "IMG0040.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 41,
        "fields": {
            "name": "Statistical Inference",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-02-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Understand the process of drawing conclusions about populations or scientific truths from data. Describe variability, distributions, limits, and confidence intervals. Use p-values, confidence intervals, and permutation tests. Make informed data analysis decisions.",
            "image_id": "IMG0041.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 42,
        "fields": {
            "name": "Regression Models",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-03-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Use regression analysis, least squares and inference. Understand ANOVA and ANCOVA model cases. Investigate analysis of residuals and variability. Describe novel uses of regression models such as scatterplot smoothing.",
            "image_id": "IMG0042.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 43,
        "fields": {
            "name": "Practical Machine Learning",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-03-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Use the basic components of building and applying prediction functions. Understand concepts such as training and tests sets, overfitting, and error rates. Describe machine learning methods such as regression or classification trees. Explain the complete process of building prediction functions.",
            "image_id": "IMG0043.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 44,
        "fields": {
            "name": "Developing Data Products",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-04-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Develop basic applications and interactive graphics using GoogleVis. Use Leaflet to create interactive annotated maps. Build an R Markdown presentation that includes a data visualization. Create a data product that tells a story to a mass audience.",
            "image_id": "IMG0044.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 45,
        "fields": {
            "name": "Data Science Capstone",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "No",
            "date": "2018-10-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Create a useful data product for the public. Apply your exploratory data analysis skills. Build an efficient and accurate prediction model. Produce a presentation deck to showcase your findings.",
            "image_id": "IMG0045.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 46,
        "fields": {
            "name": "Data Science Specialization",
            "type_of_document": "Certification",
            "institution": "John Hopkins University",
            "specialization": "Yes",
            "date": "2018-10-01",
            "paid": "Yes",
            "provider": "Coursera",
            "description": "Use R to clean, analyze, and visualize data. Navigate the entire data science pipeline from data acquisition to publication. Use GitHub to manage data science projects. Perform regression analysis, least squares and inference using regression models.",
            "image_id": "IMG0046.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 47,
        "fields": {
            "name": "Object Oriented Programming in Java",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "No",
            "date": "2021-05-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn the fundamentals of Object Oriented Programming, how to leverage the power of existing libraries, how to build graphical user interfaces, and how to use some core algorithms for searching and sorting data.",
            "image_id": "IMG0047.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 48,
        "fields": {
            "name": "Data Structures and Performance",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "Yes",
            "date": "2021-08-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use and analyze data structures that are used in industry-level applications, such as linked lists, trees, and hashtables. Explain how these data structures make programs more efficient and flexible. Apply asymptotic Big-O analysis to describe the performance of algorithms and evaluate which strategy to use for efficient data retrieval, addition of new data, deletion of elements, and/or memory usage.",
            "image_id": "IMG0048.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 49,
        "fields": {
            "name": "Advanced Data Structures in Java",
            "type_of_document": "Certification",
            "institution": "UC San Diego",
            "specialization": "No",
            "date": "2022-08-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn to represent the key pieces of data in a complex data structure. Learn about data structures, like graphs, that are fundamental for working with structured real world data. Develop, implement, and analyze algorithms for working with this data to solve real world problems. Examine what makes for good code and class hierarchy design so that not only correct code is writen, but also it is sharable with other people and maintainable in the future.",
            "image_id": "IMG0049.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 50,
        "fields": {
            "name": "Custom Models, Layers, and Loss Functions with TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearnig.AI",
            "specialization": "No",
            "date": "2020-11-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Compare Functional and Sequential APIs, discover new models you can build with the Functional API, and build a model that produces multiple outputs including a Siamese network. Build custom loss functions (including the contrastive loss function used in a Siamese network) in order to measure how well a model is doing and help your neural network learn from training data. Build off of existing standard layers to create custom layers for your models, customize a network layer with a lambda layer, understand the differences between them, learn what makes up a custom layer, and explore activation functions. Build off of existing models to add custom functionality, learn how to define your own custom class instead of using the Functional or Sequential APIs, build models that can be inherited from the TensorFlow Model class, and build a residual network (ResNet) through defining a custom model class.",
            "image_id": "IMG0050.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 51,
        "fields": {
            "name": "Custom and Distributed Training with TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearnig.AI",
            "specialization": "No",
            "date": "2021-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn about Tensor objects, the fundamental building blocks of TensorFlow, understand the difference between the eager and graph modes in TensorFlow, and learn how to use a TensorFlow tool to calculate gradients. Build your own custom training loops using GradientTape and TensorFlow Datasets to gain more flexibility and visibility with your model training. Learn about the benefits of generating code that runs in graph mode, take a peek at what graph code looks like, and practice generating this more efficient code automatically with TensorFlow tools. Harness the power of distributed training to process more data and train larger models, faster, get an overview of various distributed training strategies, and practice working with a strategy that trains on multiple GPU cores, and another that trains on multiple TPU cores.",
            "image_id": "IMG0051.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 52,
        "fields": {
            "name": "Advanced Computer Vision with TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearnig.AI",
            "specialization": "No",
            "date": "2021-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Explore image classification, image segmentation, object localization, and object detection. Apply transfer learning to object localization and detection. Apply object detection models such as regional-CNN and ResNet-50, customize existing models, and build your own models to detect, localize, and label your own rubber duck images. Implement image segmentation using variations of the fully convolutional network (FCN) including U-Net and d) Mask-RCNN to identify and detect numbers, pets, zombies, and more. Identify which parts of an image are being used by your model to make its predictions using class activation maps and saliency maps and apply these ML interpretation methods to inspect and improve the design of a famous network, AlexNet.",
            "image_id": "IMG0052.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 53,
        "fields": {
            "name": "Generative Deep Learning with TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearnig.AI",
            "specialization": "No",
            "date": "2021-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn neural style transfer using transfer learning: extract the content of an image (eg. swan), and the style of a painting (eg. cubist or impressionist), and combine the content and style into a new image. Build simple AutoEncoders on the familiar MNIST dataset, and more complex deep and convolutional architectures on the Fashion MNIST dataset, understand the difference in results of the DNN and CNN AutoEncoder models, identify ways to de-noise noisy images, and build a CNN AutoEncoder using TensorFlow to output a clean image from a noisy one. Explore Variational AutoEncoders (VAEs) to generate entirely new data, and generate anime faces to compare them against reference images. Learn about GANs; their invention, properties, architecture, and how they vary from VAEs, understand the function of the generator and the discriminator within the model, the concept of 2 training phases and the role of introduced noise, and build your own GAN that can generate faces.",
            "image_id": "IMG0053.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 54,
        "fields": {
            "name": "TensorFlow: Advanced Techniques",
            "type_of_document": "Certification",
            "institution": "DeepLearnig.AI",
            "specialization": "Yes",
            "date": "2021-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Understand the underlying basis of the Functional API and build exotic non-sequential model types, custom loss functions, and layers. Learn optimization and how to use GradientTape & Autograph, optimize training in different environments with multiple processors and chip types. Practice object detection, image segmentation, and visual interpretation of convolutions. Explore generative deep learning, and how AIs can create new content, from Style Transfer through Auto Encoding and VAEs to GANs.",
            "image_id": "IMG0054.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 55,
        "fields": {
            "name": "Database Design and Basic SQL in PostgreSQL",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Utilize psql and SQL commands to implement CRUD (Create, Read, Update, and Delete) operations for tables in a PostgreSQL database. Identify and utilize the functions of primary, logical, and foreign keys within a database. Build and differentiate between one-to-many and many-to-many relationships within PostgreSQL. Recall key people, organizations, and innovations that were instrumental to building the SQL standard.",
            "image_id": "IMG0055.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 56,
        "fields": {
            "name": "Intermediate PostgreSQL",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Utilize SQL commands for editing tables in a PostgreSQL database and produce properly normalized tables from CSV files. Appropriately handle text and dates in databases and create stored procedures. Identify hashtag algorithm and their attributes. Construct regular expressions to select rows that match a pattern.",
            "image_id": "IMG0056.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 57,
        "fields": {
            "name": "JSON and Natural Language Processing in PostgreSQL",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2022-01-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Compare Python, PostgreSQL, and JSON. Index and retrieve natural language text and JSON data; access API data and store it in a database.Create a GIN-based text reverse index and ts_vector index; build a search engine in PostgreSQL.",
            "image_id": "IMG0057.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 58,
        "fields": {
            "name": "Database Architecture, Scale, and NoSQL with Elasticsearch",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2022-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Understand PostgreSQL architecture; analyze and compare SQL and NoSQL. Compare and contrast ACID and BASE style architectures and databases. Create and utilize an Elasticsearch index in different contexts",
            "image_id": "IMG0058.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 59,
        "fields": {
            "name": "PostgreSQL for Everybody",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "Yes",
            "date": "2022-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "How to use the PostgreSQL database effectively. Explore database design principles. Dive into database architecture and deployment strategies.Compare and contrast SQL and NoSQL database design approaches and acquire skills applicable to data mining and application development.",
            "image_id": "IMG0059.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 60,
        "fields": {
            "name": "Machine Learning in Production",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-04-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Identify key components of the ML project lifecycle, pipeline & select the best deployment & monitoring patterns for different production scenarios. Optimize model performance and metrics by prioritizing disproportionately important examples that represent key slices of a dataset. Solve production challenges regarding structured, unstructured, small, and big data, how label consistency is essential, and how you can improve it.",
            "image_id": "IMG0060.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 61,
        "fields": {
            "name": "Machine Learning Data Lifecycle in Production",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Identify responsible data collection for building a fair ML production system. Implement feature engineering, transformation, and selection with TensorFlow Extended. Understand the data journey over a production system lifecycle and leverage ML metadata and enterprise schemas to address quickly evolving data.",
            "image_id": "IMG0061.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 62,
        "fields": {
            "name": "Machine Learning Modeling Pipelines in Production",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-07-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Apply techniques to manage modeling resources and best serve batch and real-time inference requests. Use analytics to address model fairness, explainability issues, and mitigate bottlenecks.",
            "image_id": "IMG0062.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 63,
        "fields": {
            "name": "Deploying Machine Learning Models in Production",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn how to deploy ML models and make them available to end-users. Build scalable and reliable hardware infrastructure to deliver inference requests both in real-time and batch depending on the use case. Implement workflow automation and progressive delivery that complies with current MLOps practices to keep a production system running. Continuously monitor your system to detect model decay, remediate performance drops, and avoid system failures so it can continuously operate at all times.",
            "image_id": "IMG0063.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 64,
        "fields": {
            "name": "Machine Learning Engineering for Production (MLOps)",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "Yes",
            "date": "2021-09-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Design an ML production system end-to-end: project scoping, data needs, modeling strategies, and deployment requirements. Establish a model baseline, address concept drift, and prototype how to develop, deploy, and continuously improve a productionized ML application. Build data pipelines by gathering, cleaning, and validating datasets. Establish data lifecycle by using data lineage and provenance metadata tools. Apply best practices and progressive delivery techniques to maintain and monitor a continuously operating production system.",
            "image_id": "IMG0064.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 65,
        "fields": {
            "name": "Web Application Technologies and Django",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-03-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Explain the basics of HTTP and how the request-response cycle works. Install and deploy a simple DJango application. Build simple web pages in HTML and style them using CSS. Explain the basic operations in SQL.",
            "image_id": "IMG0065.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 66,
        "fields": {
            "name": "Building Web Applications in Django",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-04-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Describe and build a data model in Django. Apply Django model query and template tags/code of Django Template Language (DTL). Define Class, Instance, Method. Build forms in HTML.",
            "image_id": "IMG0066.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 67,
        "fields": {
            "name": "Django Features and Libraries",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Define Django sessions and how cookies are used to support sessions. Apply built-in login functionality in Django and manage login users in views. Define one-to-many models and demonstrate how to represent links in a database. Create, edit, and delete form flow inside of a generic edit view.",
            "image_id": "IMG0067.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 68,
        "fields": {
            "name": "Using JavaScript and JSON in Django",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "No",
            "date": "2021-08-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Explain and give examples of many-to-many relationships in data modeling. Write syntactically correct JavaScript language and demonstrate debugging capabilities. Build objects using JavaScript. Explain basic elements of low-level jQuery.",
            "image_id": "IMG0068.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 69,
        "fields": {
            "name": "Django for Everybody",
            "type_of_document": "Certification",
            "institution": "University of Michigan",
            "specialization": "Yes",
            "date": "2021-08-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Install and deploy a  Django application; build HTML web pages styled by CSS. Describe and build a data model in Django, applying model query and template tags/code of Django Template Language. Apply built-in login functionality in Django; define sessions, cookies, and one-to-many models. Build objects and write syntactically correct JavaScript language; explain basic elements of low-level jQuery.",
            "image_id": "IMG0069.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 70,
        "fields": {
            "name": "Guided Tour of Machine Learning in Finance",
            "type_of_document": "Certification",
            "institution": "New York University, Tandon School of Engineering",
            "specialization": "No",
            "date": "2018-11-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Introductory and broad overview of the field of ML with the focus on applications on Finance. Supervised Machine Learning methods are used in the capstone project to predict bank closures.",
            "image_id": "IMG0070.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 71,
        "fields": {
            "name": "Fundamentals of Machine Learning in Finance",
            "type_of_document": "Certification",
            "institution": "New York University, Tandon School of Engineering",
            "specialization": "No",
            "date": "2018-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Solve practical ML-amenable problems that they may encounter in real life that include: Understanding where the problem one faces lands on a general landscape of available ML methods. Understanding which particular ML approach(es) would be most appropriate for resolving the problem. The ability to successfully implement a solution, and assess its performance.",
            "image_id": "IMG0071.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 72,
        "fields": {
            "name": "Reinforcement Learning in Finance",
            "type_of_document": "Certification",
            "institution": "New York University, Tandon School of Engineering",
            "specialization": "No",
            "date": "2019-06-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Use reinforcement learning to solve classical problems of Finance such as portfolio optimization, optimal trading, and option pricing and risk management. Practice on valuable examples such as famous Q-learning using financial problems. Apply knowledge acquired in the course to a simple model for market dynamics that is obtained using reinforcement learning as the course project.",
            "image_id": "IMG0072.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 73,
        "fields": {
            "name": "Overview of Advanced Methods of Reinforcement Learning in Finance",
            "type_of_document": "Certification",
            "institution": "New York University, Tandon School of Engineering",
            "specialization": "No",
            "date": "2019-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Links between Reinforcement Learning, option pricing and physics, implications of Inverse Reinforcement Learning for modeling market impact and price dynamics, and perception-action cycles in Reinforcement Learning. Overview trends and potential applications of Reinforcement Learning for high-frequency trading, cryptocurrencies, peer-to-peer lending, and more.",
            "image_id": "IMG0073.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 74,
        "fields": {
            "name": "Machine Learning and Reinforcement Learning in Finance",
            "type_of_document": "Certification",
            "institution": "New York University, Tandon School of Engineering",
            "specialization": "Yes",
            "date": "2019-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Compare ML for Finance with ML in Technology (image and speech recognition, robotics, etc.). Describe linear regression and classification models and methods of their evaluation. Explain how Reinforcement Learning is used for stock trading. Become familiar with popular approaches to modeling market frictions and feedback effects for option trading.",
            "image_id": "IMG0074.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 75,
        "fields": {
            "name": "Introduction to TensorFlow for Artificial Intelligence, Machine Learning, and Deep Learning",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-03-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn best practices for using TensorFlow, a popular open-source machine learning framework. Build a basic neural network in TensorFlow. Train a neural network for a computer vision application. Understand how to use convolutions to improve your neural network.",
            "image_id": "IMG0075.pdf"
        }
    },
    {

        "model": "records.record",
        "pk": 76,
        "fields": {
            "name": "Convolutional Neural Networks in TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-04-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Handle real-world image data. Plot loss and accuracy. Explore strategies to prevent overfitting, including augmentation and dropout. Learn transfer learning and how learned features can be extracted from models.",
            "image_id": "IMG0076.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 77,
        "fields": {
            "name": "Natural Language Processing in TensorFlow",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-04-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Build natural language processing systems using TensorFlow. Process text, including tokenization and representing sentences as vectors. Apply RNNs, GRUs, and LSTMs in TensorFlow. Train LSTMs on existing text to create original poetry and more.",
            "image_id": "IMG0077.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 78,
        "fields": {
            "name": "Sequences, Time Series and Prediction",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "No",
            "date": "2021-05-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Solve time series and forecasting problems in TensorFlow. Prepare data for time series learning using best practices. Explore how RNNs and ConvNets can be used for predictions. Build a sunspot prediction model using real-world data.",
            "image_id": "IMG0078.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 79,
        "fields": {
            "name": "TensorFlow Developer",
            "type_of_document": "Certification",
            "institution": "DeepLearning.AI",
            "specialization": "Yes",
            "date": "2021-05-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Best practices for TensorFlow, a popular open-source machine learning framework to train a neural network for computer vision applications. Handle real-world image data and explore strategies to prevent overfitting, including augmentation and dropout. Build natural language processing systems using TensorFlow. Apply RNNs, GRUs, and LSTMs as you train them using text repositories.",
            "image_id": "IMG0079.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 80,
        "fields": {
            "name": "Fundamentals of Scalable Data Science",
            "type_of_document": "Certification",
            "institution": "IBM",
            "specialization": "No",
            "date": "2020-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "The fundamentals of Apache Spark using python and pyspark. Introduction to Apache Spark with applications to basic exploratory and data pre-processing tasks. Fundamental statistical measures and data visualization technologies.",
            "image_id": "IMG0080.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 81,
        "fields": {
            "name": "Advanced Machine Learning and Signal Processing",
            "type_of_document": "Certification",
            "institution": "IBM",
            "specialization": "No",
            "date": "2020-11-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Learn about the fundamentals of Linear Algebra to understand how machine learning modes work. Introduce the most popular Machine Learning Frameworks for python Scikit-Learn and SparkML. Learn how to tune the models in parallel by evaluating hundreds of different parameter-combinations in parallel. Use a real-life example from IoT (Internet of Things), for exemplifying the different algorithms.",
            "image_id": "IMG0081.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 82,
        "fields": {
            "name": "Applied AI with DeepLearning",
            "type_of_document": "Certification",
            "institution": "IBM",
            "specialization": "No",
            "date": "2020-12-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Introduce the most popular DeepLearning Frameworks like Keras, TensorFlow, PyTorch, DeepLearning4J and Apache SystemML. Keras and TensorFlow make up the greatest portion of this course. Learn about Anomaly Detection, Time Series Forecasting, Image Recognition and Natural Language Processing by building up models using Keras on real-life examples from IoT (Internet of Things), Financial Marked Data, Literature or Image Databases. Learn how to scale those artificial brains using Kubernetes, Apache Spark and GPUs.",
            "image_id": "IMG0082.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 83,
        "fields": {
            "name": "Advanced Data Science Capstone",
            "type_of_document": "Certification",
            "institution": "IBM",
            "specialization": "No",
            "date": "2021-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Proven a deep understanding on massive parallel data processing, data exploration and visualization, advanced machine learning and deep learning and how to apply his knowledge in a real-world practical use case where he justifies architectural decisions, proves understanding the characteristics of different algorithms, frameworks and technologies and how they impact model performance and scalability.",
            "image_id": "IMG0083.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 84,
        "fields": {
            "name": "Advanced Data Science with IBM",
            "type_of_document": "Certification",
            "institution": "IBM",
            "specialization": "Yes",
            "date": "2021-02-01",
            "paid": "Recieved Financial Aid",
            "provider": "Coursera",
            "description": "Proven a deep understanding on massive parallel data processing, data exploration and visualization, advanced machine learning and deep learning and how to apply his knowledge in a real-world practical use case where he justifies architectural decisions, proves understanding the characteristics of different algorithms, frameworks and technologies and how they impact model performance and scalability.",
            "image_id": "IMG0084.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 85,
        "fields": {
            "name": "Introduction to Computer Science and Programming Using Python",
            "type_of_document": "Certification",
            "institution": "MITx",
            "specialization": "No",
            "date": "2016-03-01",
            "paid": "Yes",
            "provider": "EdX",
            "description": "Core elements of a programs, simple algorithms, functions, recursion, objects, debugging, assertions and exceptions, efficiency and orders of growth, memory and search.",
            "image_id": "IMG0085.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 86,
        "fields": {
            "name": "Introduction to Computational Thinking and Data Science",
            "type_of_document": "Certification",
            "institution": "MITx",
            "specialization": "No",
            "date": "2017-05-01",
            "paid": "Yes",
            "provider": "EdX",
            "description": "Optimization and Knapsack Problem, decision trees and dynamic programming, graphs, plotting, stochastic thinking, random walks, inferential statistics, Monte Carlo simulations, experimental data, machine Learning, statistical Fallacies.",
            "image_id": "IMG0086.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 87,
        "fields": {
            "name": "Using Python for Research",
            "type_of_document": "Certification",
            "institution": "HardvardX",
            "specialization": "No",
            "date": "2017-05-01",
            "paid": "Yes",
            "provider": "EdX",
            "description": "Review the basics of Python 3 programming. Learn how to use Python tools (e.g., the NumPy and SciPy modules) for research applications. Learn how to apply Python research tools in practical settings.",
            "image_id": "IMG0087.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 88,
        "fields": {
            "name": "Software Construction in Java",
            "type_of_document": "Certification",
            "institution": "MITx",
            "specialization": "No",
            "date": "2016-12-01",
            "paid": "Yes",
            "provider": "EdX",
            "description": "Static checking, code review, testing, specifications, designing Specifications, avoiding debugging, mutability and immutability, debugging, abstract data types, abstraction functions and rep invariants, interfaces, equality.",
            "image_id": "IMG0088.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 89,
        "fields": {
            "name": "Master of Arts in Economics",
            "type_of_document": "Diploma",
            "institution": "Department of Economics, Georgetown University",
            "specialization": "No",
            "date": "2005-05-01",
            "paid": "Recieved Financial Aid",
            "provider": "Georgetown University",
            "description": "'Completed the coursework for the Ph.D. in Economics from Georgetown University, took three Microeconomic theory courses (focused on General Equilibrium Theory, Game Theory, Industrial Organization, Contract Theory and Auction Theory) two Macroeconomic theory courses (focused on Economic Growth, Stochastic Dynamic General Equilibrium Modeling using Dynamic Programming, Asset Pricing, Search and Matching in the Labor Market, Overlapping Generations Models, Heterogeneous Agents Models and Dynamic Contract Theory), a Mathematical Statistics course, one course in Numerical Methods for Macroeconomics (simulating numerially all the models learned in the Macrocenomic Theory Courses), Econometrics I (Linear Regression Model using linear algebra, Gauss Markov theorem, hypothesis testing for linear regression  models, heteroscedasticity and autocorrelation (testing and adjusting when present), simultaneous equations models (identification, estimation with indirect least squares, two stage least squares, three stage least squares), Econometrics II (Asymptotic theory for regression: Convergence in Probability and in Distribution, weak and strong laws of large numbers, Lindeberg-Levy Central Limit Theoremm, Generalized Method of Momments Estimation, Panel Data, Maximum of Likelihood Estimation, Asymptotic Properties of Extremum Estimators), Political Economy (Public Choice Theory, Arrows Impossibility Theorem, Mechanism Design, Gibbard-Satterthwaite theorem, dominant strategy implementation, Nash Equilibrium and Bayesian Nash Equilibrium implementation, Incentive Compatibility, Revelation Principle, Voting Systems, Information theory).",
            "image_id": "IMG0089.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 90,
        "fields": {
            "name": "Master of Science in Economics",
            "type_of_document": "Diploma",
            "institution": "Department of Economics, University of Lausanne",
            "specialization": "No",
            "date": "1999-10-01",
            "paid": "Recieved Financial Aid",
            "provider": "Univeristy of Lausanne",
            "description": "Specialiced in Macroeconomics and Finance (one extra course in Financial Theory and another in the Microeconomics of Banking). The course curriculum included two advanced macroeconomics courses and two advanced miacroeconomics courses, and three econometrics couses among others.",
            "image_id": "IMG0090.pdf"
        }
    },
    {
        "model": "records.record",
        "pk": 91,
        "fields": {
            "name": "Bachelor of Social Science in Economics",
            "type_of_document": "Diploma",
            "institution": "Department of Economics, University of Moncton",
            "specialization": "No",
            "date": "1996-06-01",
            "paid": "Yes",
            "provider": "Univeristy of Moncton",
            "description": "The degree included the normal curriculum on introductory courses in social sciences, two courses in statistics, courses in introductury micro and macroeconomics, one course in mathematical economics and another in econometrics and six courses in the mathematics department two in linear algebra and four in calculus.",
            "image_id": "IMG0091.pdf"
        }
    }
]